package days03;

/**
 * @author Yelin
 * @date 2022. 2. 17. - 오후 4:16:32
 * @subject 연산자(operator) p86
 * @content
 */
public class Ex09 {

	public static void main(String[] args) {
		// 1. 연산자(operator) 정의? 연산을 수행하는 기호 > + ; , () {} 등등
		// 2. 덧셈 연산자 > 3 + 5
		//    피연산자(operand)? 연산자의 작업 대상(변수, 상수, 리터럴, 수식)
		// 3. 연산자 종류
		//        [기능]
		//   ㄱ. 산술 연산자    + - * / %     >    Ex09_02
		//   ㄴ. 비교 연산자                  >    Ex09_03
		//   ㄷ. 논리 연산자
		//       1) 일반논리 연산자 : !  && ||
		//       2) 비트논리 연산자 : ~  &  |  ^
		//   ㄹ. 대입 연산자
		//   ㅁ. 기타 연산자
		//   ㅂ. 쉬프트 연산자  >>  << >>>

		// [피연산자의 갯수]
		//  ㄱ. 단항 연산자
		//  ㄴ. 이항 연산자
		//  ㄷ. 삼항 연산자

	}

}
