package days12;

/**
 * @author Yelin
 * @date 2022. 3. 4. - 오후 4:22:06
 * @subject 다차원 배열의 초기화
 * @content
 */
public class Ex11_03 {

	public static void main(String[] args) {
		// 1차원 배열 초기화
		// int[] m = new int[] {1,2,3,4,5,6,7,8};
		// int[] m = {1,2,3,4,5,6,7,8}; // 제일 많이 사용
		
		// 2차원 배열 초기화
		/*
		int[][] m = new int[2][4];
		m[0][0] = 1; m[0][1] = 2; m[0][2] = 3; m[0][3] = 4;
		*/
		
		/*
		 int[][] m= new int[][]{ // [][]안에 행, 열 값을 넣으면 에러 발생
							   {1,2,3,4},
							   {5,6,7,8}
							  };
		*/
		
		/*
		int[][] m = { // 제일 많이 사용
							{1,2,3,4},
							{5,6,7,8}
						};
		*/
		
		// 3차원 배열 초기화
		// int[][][] m = new int[2][2][2];
		/*
		m[0][0][0] = 1; m[0][0][1] = 2;
		m[0][1][0] = 3; m[0][1][1] = 4;
		
		m[1][0][0] = 5; m[1][0][1] = 6;
		m[1][1][0] = 7; m[1][1][1] = 8;
		*/
		/*
		int[][][] m = new int[][][] {
										{
											{1,2}, // 
											{3,4}
										}, // 1면
										{
											{5,6}, {7,8}
										} // 2면
								};
		*/						
		int[][][] m = new int[][][] {  {  {1,2}, {3,4} },	{  {5,6}, {7,8}  }  };		
		
		
	} // main

} // class
