package days12;

/**
 * @author Yelin
 * @date 2022. 3. 4. - 오후 3:27:15
 * @subject p214 다차원배열
 * @content 
 */
public class Ex11 {

	public static void main(String[] args) {
		/*
		* 다차원 배열? 2차원 이상의 배열을 다차원 배열이라고 한다.
		*				2차원 배열, 3차원 배열, 4차원 배열...(메모리 허용 한도까지 n차원 배열 가능)
		* 지금까지 사용한 배열은 1차원 배열이다.
 		*
 		* 1차원 배열 "열"
 		* 2차원 배열 "행" "열"
 		* 3차원 배열 "면" "행" "열"
 		* 4차원 배열 "권" "면" "행" "열"
		*
		*/
		
		// 4행 2열 2차원 배열
		int[][] m = new int[4][2];

		// 2면 3행 4열 3차원 배열
		int[][][] n = new int[2][3][4];
		
		// 2권 2면 3행 4열 4차원 배열
		int[][][][] k = new int[2][2][3][4];

		
	} // main

} // class
